app/Controllers/AdminController.php

SELECT `reservasi`.*, `tamu`.`nama_tamu`, `kamar`.`tipe_kamar`
FROM `reservasi`
LEFT JOIN `tamu` ON `tamu`.`id_tamu` = `reservasi`.`id_tamu`
LEFT JOIN `detail_reservasi_kamar` ON `detail_reservasi_kamar`.`id_reservasi` = `reservasi`.`id_reservasi`
LEFT JOIN `kamar` ON `kamar`.`id_kamar` = `detail_reservasi_kamar`.`id_kamar`
WHERE `reservasi`.`status` = 'Reserved'
---
    public function index()
    {
        $reservasiModel = new ReservasiModel();
        $data['reservations'] = $reservasiModel
            ->join('tamu', 'tamu.id_tamu = reservasi.id_tamu', 'left')
            ->join('detail_reservasi_kamar', 'detail_reservasi_kamar.id_reservasi = reservasi.id_reservasi', 'left')
            ->join('kamar', 'kamar.id_kamar = detail_reservasi_kamar.id_kamar', 'left')
            ->where('reservasi.status', 'Reserved')
            ->select('reservasi.*, tamu.nama_tamu, kamar.tipe_kamar')
            ->findAll();

SELECT `reservasi`.*, `tamu`.`nama_tamu`, `kamar`.`tipe_kamar`
FROM `reservasi`
LEFT JOIN `tamu` ON `tamu`.`id_tamu` = `reservasi`.`id_tamu`
LEFT JOIN `detail_reservasi_kamar` ON `detail_reservasi_kamar`.`id_reservasi` = `reservasi`.`id_reservasi`
LEFT JOIN `kamar` ON `kamar`.`id_kamar` = `detail_reservasi_kamar`.`id_kamar`
WHERE `reservasi`.`status` = 'Check-In'
---
    public function checkinPage()
    {
        $reservasiModel = new ReservasiModel();
        $data['reservations'] = $reservasiModel
            ->join('tamu', 'tamu.id_tamu = reservasi.id_tamu', 'left')
            ->join('detail_reservasi_kamar', 'detail_reservasi_kamar.id_reservasi = reservasi.id_reservasi', 'left')
            ->join('kamar', 'kamar.id_kamar = detail_reservasi_kamar.id_kamar', 'left')
            ->where('reservasi.status', 'Check-In')
            ->select('reservasi.*, tamu.nama_tamu, kamar.tipe_kamar')
            ->findAll();

SELECT `reservasi`.*, `tamu`.`nama_tamu`, `kamar`.`tipe_kamar`
FROM `reservasi`
LEFT JOIN `tamu` ON `tamu`.`id_tamu` = `reservasi`.`id_tamu`
LEFT JOIN `detail_reservasi_kamar` ON `detail_reservasi_kamar`.`id_reservasi` = `reservasi`.`id_reservasi`
LEFT JOIN `kamar` ON `kamar`.`id_kamar` = `detail_reservasi_kamar`.`id_kamar`
WHERE `reservasi`.`status` = 'selesai'
---
    public function history()
    {
        $reservasiModel = new ReservasiModel();
        $data['reservations'] = $reservasiModel
            ->join('tamu', 'tamu.id_tamu = reservasi.id_tamu', 'left')
            ->join('detail_reservasi_kamar', 'detail_reservasi_kamar.id_reservasi = reservasi.id_reservasi', 'left')
            ->join('kamar', 'kamar.id_kamar = detail_reservasi_kamar.id_kamar', 'left')
            ->where('reservasi.status', 'selesai')
            ->select('reservasi.*, tamu.nama_tamu, kamar.tipe_kamar')
            ->findAll();

SELECT `reservasi`.*, `tamu`.`nama_tamu`, `kamar`.`tipe_kamar`
FROM `reservasi`
LEFT JOIN `tamu` ON `tamu`.`id_tamu` = `reservasi`.`id_tamu`
LEFT JOIN `detail_reservasi_kamar` ON `detail_reservasi_kamar`.`id_reservasi` = `reservasi`.`id_reservasi`
LEFT JOIN `kamar` ON `kamar`.`id_kamar` = `detail_reservasi_kamar`.`id_kamar`
WHERE `reservasi`.`id_reservasi` = '2'
INSERT INTO `riwayat` (`nama_tamu`, `tipe_kamar`, `tgl_masuk`, `tgl_keluar`, `total_bayar`, `tgl_penyelesaian`, `status_saat_selesai`) VALUES ('Citra Lestari', 'Superior Twin', '2025-08-06', '2025-08-08', '2400000.00', '2025-07-16 17:48:44', 'selesai')
UPDATE `reservasi` SET `status` = 'selesai'
WHERE `reservasi`.`id_reservasi` IN ('2')
---
    public function selesaikanReservasi($id_reservasi)
    {
        $reservasiModel = new ReservasiModel();
        $riwayatModel = new RiwayatModel(); // Inisialisasi RiwayatModel

        // Ambil detail reservasi yang akan diselesaikan
        // Pastikan Anda mengambil semua data yang diperlukan untuk tabel riwayat
        $reservation = $reservasiModel
            ->join('tamu', 'tamu.id_tamu = reservasi.id_tamu', 'left')
            ->join('detail_reservasi_kamar', 'detail_reservasi_kamar.id_reservasi = reservasi.id_reservasi', 'left')
            ->join('kamar', 'kamar.id_kamar = detail_reservasi_kamar.id_kamar', 'left')
            ->select('reservasi.*, tamu.nama_tamu, kamar.tipe_kamar')
            ->find($id_reservasi);

        if ($reservation) {
            // Siapkan data untuk dimasukkan ke tabel riwayat
            $dataToHistory = [
                'nama_tamu' => $reservation['nama_tamu'],
                'tipe_kamar' => $reservation['tipe_kamar'],
                'tgl_masuk' => $reservation['tgl_masuk'], // Disesuaikan dengan nama kolom di tabel reservasi Anda
                'tgl_keluar' => $reservation['tgl_keluar'], // Disesuaikan dengan nama kolom di tabel reservasi Anda
                'total_bayar' => $reservation['total_harga_reservasi'], // Disesuaikan dengan nama kolom di tabel reservasi Anda
                'tgl_penyelesaian' => date('Y-m-d H:i:s'), // Tanggal dan waktu saat ini
                'status_saat_selesai' => 'selesai'
            ];

            // Masukkan data ke tabel riwayat
            $riwayatModel->insert($dataToHistory);

            // Perbarui status reservasi menjadi 'selesai'
            $reservasiModel->update($id_reservasi, ['status' => 'selesai']);