app/Controllers/AuthController.php

    public function processLogin()
    {
        $rules = [
            'email'    => 'required|valid_email',
            'password' => 'required'
        ];

        if (!$this->validate($rules)) {
            log_message('debug', 'Login validation failed for email: ' . $this->request->getPost('email'));
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $email = $this->request->getPost('email');
        $password = md5($this->request->getPost('password')); // Menggunakan md5() sesuai permintaan

        $admin = $this->adminModel->where('email', $email)->first();
---
SELECT *
FROM `admin`
WHERE `email` = 'satria@mail.com'
 LIMIT 1

            }
        }

        $tamu = $this->tamuModel->where('email', $email)->first();
---
SELECT *
FROM `tamu`
WHERE `email` = 'satria@mail.com'
 LIMIT 1