app/Controllers/AuthController.php

SELECT *
FROM `admin`
WHERE `email` = '1@1.com'
 LIMIT 1
---
    public function processLogin()
    {
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');
        $hashedPassword = md5($password);

        $adminModel = new AdminModel();
        $tamuModel = new TamuModel();

        // Cek di tabel admin
        $admin = $adminModel->where('email', $email)->first();