app/Controllers/KamarController.php

SELECT *
FROM `kamar`
---
    public function index()
    {
        $kamarModel = new KamarModel();
        $data['rooms'] = $kamarModel->findAll();

SELECT *
FROM `kamar`
WHERE `kamar`.`id_kamar` = '12'
---
    public function delete($id)
    {
        $kamarModel = new KamarModel();
        $detailReservasiModel = new DetailReservasiKamarModel();

        // 1. Cek apakah kamar ini digunakan di tabel detail_reservasi_kamar
        $isUsed = $detailReservasiModel->where('id_kamar', $id)->first();