app/Controllers/KamarController.php


        log_message('info', 'Data final yang akan diperbarui untuk kamar ID ' . $id . ': ' . json_encode($data));
        // Perbarui data di database
        if ($kamarModel->update($id, $data)) {
---
UPDATE `kamar` SET `tipe_kamar` = 'Kamar Mayat 100', `harga_kamar` = '600000.00', `jenis_ranjang` = 'Single Bed', `jumlah_tamu` = '14', `deskripsi` = 'Kamar khusus dengan kapasitas sangat besar.wda'
WHERE `kamar`.`id_kamar` IN ('5')