app/Controllers/TamuController.php

SELECT `drk`.`id_kamar` as `id_unit_kamar`
FROM `reservasi` `r`
JOIN `detail_reservasi_kamar` `drk` ON `drk`.`id_reservasi` = `r`.`id_reservasi`
WHERE `r`.`status` != 'selesai'
AND   (
`r`.`tgl_masuk` < '2025-07-21'
AND `r`.`tgl_keluar` > '2025-07-19'
 )
---
        // Logika Ketersediaan Kamar
        // 1. Dapatkan semua id_unit_kamar yang sudah terreservasi pada rentang tanggal tersebut
        $db = \Config\Database::connect();
        $reservedUnitIds = $db->table('reservasi r')
            ->select('drk.id_kamar as id_unit_kamar') // id_kamar di detail_reservasi_kamar sebenarnya merujuk ke id_unit_kamar
            ->join('detail_reservasi_kamar drk', 'drk.id_reservasi = r.id_reservasi')
            ->where('r.status !=', 'selesai') // Jangan cek reservasi yang sudah selesai
            ->groupStart()
                ->where('r.tgl_masuk <', $tgl_keluar)
                ->where('r.tgl_keluar >', $tgl_masuk)
            ->groupEnd()
            ->get()
            ->getResultArray();

SELECT `unit_kamar`.`id_unit_kamar`, `unit_kamar`.`nomor_kamar`, `kamar`.`id_kamar`, `kamar`.`tipe_kamar`, `kamar`.`harga_kamar`, `kamar`.`jenis_ranjang`, `kamar`.`jumlah_tamu`, `kamar`.`foto`, `kamar`.`deskripsi`
FROM `unit_kamar`
JOIN `kamar` ON `kamar`.`id_kamar` = `unit_kamar`.`id_kamar`
WHERE `kamar`.`jumlah_tamu` >= '1'
---

        // 2. Dapatkan semua unit_kamar yang cocok dengan jumlah tamu
        //    dan TIDAK ADA di daftar unit yang sudah terreservasi
        $availableRooms = $this->unitKamarModel
            ->select('unit_kamar.id_unit_kamar, unit_kamar.nomor_kamar, kamar.id_kamar, kamar.tipe_kamar, kamar.harga_kamar, kamar.jenis_ranjang, kamar.jumlah_tamu, kamar.foto, kamar.deskripsi')
            ->join('kamar', 'kamar.id_kamar = unit_kamar.id_kamar')
            ->where('kamar.jumlah_tamu >=', $jumlah_tamu);

SELECT *
FROM `tamu`
WHERE `tamu`.`id_tamu` = '4'
---
    public function editProfil()
    {
        log_message('debug', 'TamuController: editProfil method triggered.');
        if (!session()->get('isLoggedIn') || session()->get('role') !== 'tamu') {
            return redirect()->to(base_url('login'));
        }

        $id_tamu = session()->get('id_tamu');

        // Menggunakan model yang sudah diinisialisasi di constructor
        $userData = $this->tamuModel->find($id_tamu);

UPDATE `tamu` SET `nama_tamu` = 'satria', `no_hp_tamu` = '13513512414', `email` = 'm1@mail.com', `password` = '$2y$10$MCJWDrrXVBwBTeiBvQyfme7ZaDaJlQTbNnTXC/CiF7GDnc8fvoc6a'
WHERE `tamu`.`id_tamu` IN ('4')
---
    public function updateProfil()
    {
        if (!session()->get('isLoggedIn') || session()->get('role') !== 'tamu') {
            return redirect()->to(base_url('login'));
        }

        $id_tamu = session()->get('id_tamu');

        $dataToUpdate = [
            'id_tamu'    => $id_tamu,
            'nama_tamu'  => $this->request->getPost('nama_tamu'),
            'no_hp_tamu' => $this->request->getPost('no_hp_tamu'),
            'email'      => $this->request->getPost('email'),
        ];

        $password = $this->request->getPost('password');
        if (!empty($password)) {
            $dataToUpdate['password'] = $password;
        } else {
            $this->tamuModel->validationRules['password'] = 'permit_empty|min_length[6]';
        }

        if ($this->tamuModel->save($dataToUpdate) === false) {