app/Controllers/TamuController.php

SELECT *
FROM `kamar`
WHERE `jumlah_tamu` >= '1'
---

        $reservedIds = array_column($reservedKamarIds, 'id_kamar');

        $availableRooms = $this->kamarModel->where('jumlah_tamu >=', $jumlah_tamu);