app/Models/ReservasiModel.php

SELECT `r`.`id_reservasi`, `r`.`tgl_masuk`, `r`.`tgl_keluar`, `t`.`nama_tamu`, `k`.`tipe_kamar`, `p`.`id_pembayaran`
FROM `reservasi` `r`
JOIN `tamu` `t` ON `t`.`id_tamu` = `r`.`id_tamu`
LEFT JOIN `detail_reservasi_kamar` `drk` ON `drk`.`id_reservasi` = `r`.`id_reservasi`
LEFT JOIN `kamar` `k` ON `k`.`id_kamar` = `drk`.`id_kamar`
LEFT JOIN `pembayaran` `p` ON `p`.`id_reservasi` = `r`.`id_reservasi`
LEFT JOIN `riwayat` `rw` ON `rw`.`id_reservasi` = `r`.`id_reservasi`
WHERE `rw`.`id_riwayat` IS NULL
ORDER BY `r`.`tgl_masuk` ASC
---
    public function getActiveReservations()
    {
        return $this->db->table('reservasi r')
            ->select('r.id_reservasi, r.tgl_masuk, r.tgl_keluar, t.nama_tamu, k.tipe_kamar, p.id_pembayaran, r.status') // Menambahkan r.status
            ->join('tamu t', 't.id_tamu = r.id_tamu', 'left')
            ->join('detail_reservasi_kamar drk', 'drk.id_reservasi = r.id_reservasi', 'left')
            ->join('kamar k', 'k.id_kamar = drk.id_kamar', 'left')
            ->join('pembayaran p', 'p.id_reservasi = r.id_reservasi', 'left')
            ->join('riwayat rw', 'rw.id_reservasi = r.id_reservasi', 'left') // Join ke tabel riwayat
            ->where('rw.id_riwayat IS NULL') // Hanya ambil yang BELUM ada di riwayat
            ->orderBy('r.tgl_masuk', 'ASC')
            ->get()
            ->getResultArray();